CI plan lgtm

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.cld_epa_gov_727fd0f2717d53b7e842bb638eb4b08b_cld_epa_gov_cname will be destroyed
  - resource "aws_route53_record" "cld_epa_gov_727fd0f2717d53b7e842bb638eb4b08b_cld_epa_gov_cname" {
      - allow_overwrite = true -> null
      - fqdn            = "727fd0f2717d53b7e842bb638eb4b08b.cld.epa.gov" -> null
      - id              = "Z14DYDCLDD8LRO_727fd0f2717d53b7e842bb638eb4b08b.cld.epa.gov._CNAME" -> null
      - name            = "727fd0f2717d53b7e842bb638eb4b08b.cld.epa.gov" -> null
      - records         = [
          - "15bb28ca361cc33db177c9783c8a6a1c5eea0e12.comodoca.com.",
        ] -> null
      - ttl             = 300 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z14DYDCLDD8LRO" -> null
    }

  # aws_route53_record.cld_epa_gov_cld_epa_gov_a will be destroyed
  - resource "aws_route53_record" "cld_epa_gov_cld_epa_gov_a" {
      - allow_overwrite = true -> null
      - fqdn            = "cld.epa.gov" -> null
      - id              = "Z14DYDCLDD8LRO_cld.epa.gov._A" -> null
      - name            = "cld.epa.gov" -> null
      - records         = [] -> null
      - ttl             = 0 -> null
      - type            = "A" -> null
      - zone_id         = "Z14DYDCLDD8LRO" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "cld-epa-gov-el-elb-1vx5r8b4nx40-1695709490.us-east-1.elb.amazonaws.com" -> null
          - zone_id                = "Z35SXDOTRQ7X7K" -> null
        }
    }

  # aws_route53_record.cld_epa_gov_star_cld_epa_gov_a will be destroyed
  - resource "aws_route53_record" "cld_epa_gov_star_cld_epa_gov_a" {
      - allow_overwrite = true -> null
      - fqdn            = "*.cld.epa.gov" -> null
      - id              = "Z14DYDCLDD8LRO_*.cld.epa.gov._A" -> null
      - name            = "*.cld.epa.gov" -> null
      - records         = [] -> null
      - ttl             = 0 -> null
      - type            = "A" -> null
      - zone_id         = "Z14DYDCLDD8LRO" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "cld-epa-gov-el-elb-1vx5r8b4nx40-1695709490.us-east-1.elb.amazonaws.com" -> null
          - zone_id                = "Z35SXDOTRQ7X7K" -> null
        }
    }

  # aws_route53_record.d_18f_gov_grafana_18f_gov_a will be destroyed
  - resource "aws_route53_record" "d_18f_gov_grafana_18f_gov_a" {
      - allow_overwrite = true -> null
      - fqdn            = "grafana.18f.gov" -> null
      - id              = "Z3483KZZQUUYZQ_grafana.18f.gov_A" -> null
      - name            = "grafana.18f.gov" -> null
      - records         = [] -> null
      - ttl             = 0 -> null
      - type            = "A" -> null
      - zone_id         = "Z3483KZZQUUYZQ" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "18f-grafana-1906882244.us-east-1.elb.amazonaws.com" -> null
          - zone_id                = "Z35SXDOTRQ7X7K" -> null
        }
    }

  # aws_route53_record.gsaforecast_gsa_gov_7575ddfce54082fe732d00e132bb2340_gsaforecast_gsa_gov_cname will be destroyed
  - resource "aws_route53_record" "gsaforecast_gsa_gov_7575ddfce54082fe732d00e132bb2340_gsaforecast_gsa_gov_cname" {
      - allow_overwrite = true -> null
      - fqdn            = "7575ddfce54082fe732d00e132bb2340.gsaforecast.gsa.gov" -> null
      - id              = "Z1NJJKPUIHV9O8_7575ddfce54082fe732d00e132bb2340.gsaforecast.gsa.gov._CNAME" -> null
      - name            = "7575ddfce54082fe732d00e132bb2340.gsaforecast.gsa.gov" -> null
      - records         = [
          - "6e8adb27ac503c17cd79c9c6f35e7c0f2ea69d53.comodoca.com.",
        ] -> null
      - ttl             = 300 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z1NJJKPUIHV9O8" -> null
    }

  # aws_route53_record.gsaforecast_gsa_gov_gsaforecast_gsa_gov_a will be destroyed
  - resource "aws_route53_record" "gsaforecast_gsa_gov_gsaforecast_gsa_gov_a" {
      - allow_overwrite = true -> null
      - fqdn            = "gsaforecast.gsa.gov" -> null
      - id              = "Z1NJJKPUIHV9O8_gsaforecast.gsa.gov._A" -> null
      - name            = "gsaforecast.gsa.gov" -> null
      - records         = [] -> null
      - ttl             = 0 -> null
      - type            = "A" -> null
      - zone_id         = "Z1NJJKPUIHV9O8" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "gsaforecast-gsa-gov-34157864.us-east-1.elb.amazonaws.com" -> null
          - zone_id                = "Z35SXDOTRQ7X7K" -> null
        }
    }

  # aws_route53_record.staging_code_gov_aaaa will be created
  + resource "aws_route53_record" "staging_code_gov_aaaa" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.code.gov"
      + type            = "AAAA"
      + zone_id         = "Z29HGHN9YS67EX"

      + alias {
          + evaluate_target_health = false
          + name                   = "d3g0jy911fqt1l.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 1 to add, 0 to change, 6 to destroy.
```
